#### terraform plan every: cad2ef7
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:554506578892:certificate/fd848ba2-f89b-4d20-9b42-40f7fc9cab2c]
aws_api_gateway_rest_api.example: Refreshing state... [id=uo7vejn591]
aws_dynamodb_table.spotify-poc: Refreshing state... [id=spotify-poc]
aws_iam_role.iam_role_for_lambda: Refreshing state... [id=lambda-invoke-role]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/aws/lambda/java_lambda_function]
aws_iam_policy.iam_policy_for_lambda: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda-invoke-policy]
aws_dynamodb_table.spotify-dynamo-music: Refreshing state... [id=spotify-dynamo-music]
aws_iam_role_policy_attachment.aws_iam_role_policy_attachment: Refreshing state... [id=lambda-invoke-role-20210517054657159100000001]
aws_route53_record.validations["spotify-line.moikilo00.net"]: Refreshing state... [id=Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME]
aws_acm_certificate_validation.main: Refreshing state... [id=2021-06-30 01:59:34 +0000 UTC]
aws_api_gateway_resource.proxy: Refreshing state... [id=ixthbt]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-uo7vejn591-6s0om962qh-ANY]
aws_lambda_function.java_lambda_function: Refreshing state... [id=java_lambda_function]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-uo7vejn591-ixthbt-ANY]
aws_iam_policy.lambda_dynamo: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo-policy]
aws_iam_policy.lambda_dynamo_music: Refreshing state... [id=arn:aws:iam::554506578892:policy/lambda_dynamo_music-policy]
aws_iam_role_policy_attachment.lambda_dynamo: Refreshing state... [id=lambda-invoke-role-20210517180640035500000001]
aws_iam_role_policy_attachment.lambda_dynamo_music: Refreshing state... [id=lambda-invoke-role-20210628073423139200000001]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-uo7vejn591-ixthbt-ANY]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-uo7vejn591-6s0om962qh-ANY]
aws_api_gateway_deployment.example: Refreshing state... [id=7avmde]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_acm_certificate.main has been deleted
  - resource "aws_acm_certificate" "main" {
      - arn                       = "arn:aws:acm:ap-northeast-1:554506578892:certificate/fd848ba2-f89b-4d20-9b42-40f7fc9cab2c" -> null
      - domain_name               = "spotify-line.moikilo00.net" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "spotify-line.moikilo00.net"
              - resource_record_name  = "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_c0600d7660b38d0259cdb57f36bbce46.gwpjclltnz.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ap-northeast-1:554506578892:certificate/fd848ba2-f89b-4d20-9b42-40f7fc9cab2c" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - tags_all                  = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }
  # aws_route53_record.validations["spotify-line.moikilo00.net"] has been changed
  ~ resource "aws_route53_record" "validations" {
        id      = "Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME"
        name    = "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net"
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.main will be created
  + resource "aws_acm_certificate" "main" {
      + arn                       = (known after apply)
      + domain_name               = "spotify-line.moikilo00.net"
      + domain_validation_options = [
          + {
              + domain_name           = "spotify-line.moikilo00.net"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags_all                  = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.main must be replaced
-/+ resource "aws_acm_certificate_validation" "main" {
      ~ certificate_arn         = "arn:aws:acm:ap-northeast-1:554506578892:certificate/fd848ba2-f89b-4d20-9b42-40f7fc9cab2c" -> (known after apply) # forces replacement
      ~ id                      = "2021-06-30 01:59:34 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net",
        ] -> (known after apply) # forces replacement
    }

  # aws_api_gateway_domain_name.main will be created
  + resource "aws_api_gateway_domain_name" "main" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = "spotify-line.moikilo00.net"
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = (known after apply)
      + tags_all                = (known after apply)

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # aws_lambda_function.java_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "java_lambda_function" {
        id                             = "java_lambda_function"
      ~ last_modified                  = "2021-06-30T01:59:15.946+0000" -> (known after apply)
      ~ source_code_hash               = "b74S/wiTB/L4WH+HPtG6IKpU2U+paahppkYkGfN5OvY=" -> "GaUFurj4XNQhhO21APDLbE+5M0ZZwydbim1CWymQe58="
        tags                           = {}
        # (23 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.spotify-line will be created
  + resource "aws_route53_record" "spotify-line" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "spotify-line.moikilo00.net"
      + type            = "A"
      + zone_id         = "Z04052072YGY8CIREK2A2"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.validations["spotify-line.moikilo00.net"] must be replaced
-/+ resource "aws_route53_record" "validations" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net" -> (known after apply)
      ~ id              = "Z04052072YGY8CIREK2A2__e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net._CNAME" -> (known after apply)
      ~ name            = "_e2490495fb7f42c5629334ae790825dc.spotify-line.moikilo00.net" -> (known after apply) # forces replacement
      ~ records         = [
          - "_c0600d7660b38d0259cdb57f36bbce46.gwpjclltnz.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

Warning: Quoted references are deprecated

  on cert-route.tf line 27, in resource "aws_acm_certificate" "main":
  27:   provider          = "aws.virginia"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>




*Pusher: @lazmond3, Action: `pull_request`*